In [37]:
import pandas as pd
import glob

# Get a list of all CSV file paths in the data folder
csv_files = glob.glob('data/*.csv')

# Load each CSV file as a dataframe
dataframes = {}
for file in csv_files:
    # Extract the filename without extension as the dataframe name
    dataframe_name = file.split('/')[-1].split('\\')[-1].split('.')[0]
    # Load the CSV file as a dataframe
    dataframes[dataframe_name] = pd.read_csv(file)

# Access the dataframes using their names
class_enrollment_facts_df = dataframes['class_enrollment_facts']
classes_df = dataframes['classes']
departments_df = dataframes['departments']
schools_df = dataframes['schools']
students_df = dataframes['students']

In [38]:
class_enrollment_facts_df.head()

,class_id,class_year,class_semester,enrollment_count,waitlist_count,withdrawal_count,tuition_revenue,fee_revenue,tuition_increase
0,1,2,5,14,171,2,21438.20,1864.36,0.27
1,2,1,3,14,137,2,35775.22,3138.22,0.46
2,3,3,6,45,365,6,16230.84,7504.35,0.38
3,4,3,6,55,362,8,43033.84,7902.92,0.27
4,5,4,9,58,408,8,35106.58,8788.23,0.21

In [39]:
classes_df.head()

,class_id,department_id,school_id,class_name,class_year,class_semester,class_cost,class_type,class_size
0,1,7,2,"('2nd', 0.4)",2022,3,310.38,"('Lecture', 0.9)",22
1,2,4,3,"('1st', 0.4)",2023,2,410.30,"('Lecture', 0.9)",34
2,3,3,4,"('2nd', 0.4)",2023,4,123.73,"('Lab', 0.1)",49
3,4,9,4,"('1st', 0.4)",2023,3,234.02,"('Lab', 0.1)",21
4,5,9,4,"('1st', 0.4)",2022,1,346.83,"('Lab', 0.1)",29

In [40]:
departments_df.head()

   department_id                                    department_name  school_id
0              1                     Department of Computer Science          3
1              2  Department of Information Systems and Computer...          5
2              3                          Department of Mathematics          2
3              4                              Department of Physics          5
4              5                            Department of Chemistry          2

In [41]:
schools_df.head()

   school_id                                        school_name
0          1                  School of Science and Engineering
1          2                John Gokongwei School of Management
2          3                               School of Humanities
3          4                          School of Social Sciences
4          5  Gokongwei Brothers School of Education and Lea...

In [42]:
students_df.head()

   student_id        student_name  enrollment_year
0           1  Alexander Sullivan             2022
1           2    Timothy Erickson             2023
2           3        Amber Taylor             2022
3           4     Jennifer Deleon             2021
4           5   Christopher Smith             2020

In [43]:
# Merge the ClassEnrollmentFacts with Classes, Departments, and Schools
merged_df = pd.merge(class_enrollment_facts_df, classes_df, on='class_id')
merged_df = pd.merge(merged_df, departments_df, on='department_id')

merged_df.head()
# merged_df = pd.merge(merged_df, schools_df, on='school_id')

,class_id,class_year_x,class_semester_x,enrollment_count,waitlist_count,withdrawal_count,tuition_revenue,fee_revenue,tuition_increase,department_id,school_id_x,class_name,class_year_y,class_semester_y,class_cost,class_type,class_size,department_name,school_id_y
0,1,2,5,14,171,2,21438.20,1864.36,0.27,7,2,"('2nd', 0.4)",2022,3,310.38,"('Lecture', 0.9)",22,Department of Psychology,4
1,13,1,7,62,111,10,35514.77,6035.56,0.37,7,4,"('1st', 0.4)",2023,3,440.99,"('Lecture', 0.9)",31,Department of Psychology,4
2,35,4,5,69,146,4,26254.59,6836.12,0.49,7,1,"('IS', 0.2)",2022,1,344.38,"('Lecture', 0.9)",40,Department of Psychology,4
3,39,4,7,55,346,6,10216.08,6486.50,0.31,7,1,"('IS', 0.2)",2023,4,349.72,"('Lecture', 0.9)",44,Department of Psychology,4
4,49,1,2,21,273,2,14318.28,8780.30,0.35,7,1,"('IS', 0.2)",2022,2,165.96,"('Lab', 0.1)",40,Department of Psychology,4

## Extracting Metrics

In [ ]:
# Revenue per school and department for the current semester vs the last semester of the same school year

In [ ]:
# Revenue per school and department for the current semester of the current year vs the same semester of the last school year

In [ ]:
# Which school offers the most profitable classes?

In [ ]:
# Which department offers the most profitable classes?